espressif/openocd-esp32/contrib/loaders/flash/espressif/stub_flasher.c
// SPDX-License-Identifier: GPL-2.0-or-later

/***************************************************************************
 *   ESP flasher stub                                                      *
 *   Copyright (C) 2017-2019 Espressif Systems Ltd.                        *
 *   Author: Alexey Gerenkov <alexey@espressif.com>                        *
 ***************************************************************************/
#include <stdarg.h>
#include <string.h>

#include <freertos/portmacro.h>

#include <esp_flash_partitions.h>
#include <esp_image_format.h>

#include <stub_flasher_chip.h>

#include "stub_flasher.h"
#include "stub_logger.h"
#include "stub_flasher_int.h"
#include "stub_apptrace.h"

#include "mcu_boot.h"

#if STUB_LOG_ENABLE == 1
	#define STUB_BENCH(var)	\
	uint64_t var = stub_get_time()
#else
	#define STUB_BENCH(var)	\
	do {} while (0)
#endif

#define STUB_BP_INSN_SECT_BUF_SIZE        (2 * STUB_FLASH_SECTOR_SIZE)

#define CHECKSUM_ALIGN        16
#define IS_PADD(addr) ((addr) == 0)
#define IS_DRAM(addr) ((addr) >= SOC_DRAM_LOW && (addr) < SOC_DRAM_HIGH)
#define IS_IRAM(addr) ((addr) >= SOC_IRAM_LOW && (addr) < SOC_IRAM_HIGH)
#define IS_IROM(addr) ((addr) >= SOC_IROM_LOW && (addr) < SOC_IROM_HIGH)
#define IS_DROM(addr) ((addr) >= SOC_DROM_LOW && (addr) < SOC_DROM_HIGH)
#define IS_SRAM(addr) (IS_IRAM(addr) || IS_DRAM(addr))
#define IS_MMAP(addr) (IS_IROM(addr) || IS_DROM(addr))
#if SOC_RTC_FAST_MEM_SUPPORTED
# define IS_RTC_FAST_IRAM(addr) \
					((addr) >= SOC_RTC_IRAM_LOW && (addr) < SOC_RTC_IRAM_HIGH)
#define IS_RTC_FAST_DRAM(addr) \
					((addr) >= SOC_RTC_DRAM_LOW && (addr) < SOC_RTC_DRAM_HIGH)
#else
#define IS_RTC_FAST_IRAM(addr) 0
#define IS_RTC_FAST_DRAM(addr) 0
#endif
#if SOC_RTC_SLOW_MEM_SUPPORTED
#define IS_RTC_SLOW_DRAM(addr) \
					((addr) >= SOC_RTC_DATA_LOW && (addr) < SOC_RTC_DATA_HIGH)
#else
#define IS_RTC_SLOW_DRAM(addr) 0
#endif

#if SOC_MEM_TCM_SUPPORTED
#define IS_TCM(addr) ((addr) >= SOC_TCM_LOW && (addr) < SOC_TCM_HIGH)
#else
#define IS_TCM(addr) 0
#endif

#define IS_NONE(addr) (!IS_IROM(addr) && !IS_DROM(addr) \
					&& !IS_IRAM(addr) && !IS_DRAM(addr) \
					&& !IS_RTC_FAST_IRAM(addr) && !IS_RTC_FAST_DRAM(addr) \
					&& !IS_RTC_SLOW_DRAM(addr) && !IS_TCM(addr) \
					&& !IS_PADD(addr))

#define MAX_SEGMENT_COUNT 16

extern void stub_sha256_start(void);
extern void stub_sha256_data(const void *data, size_t data_len);
extern void stub_sha256_finish(uint8_t *digest);

extern uint32_t _bss_start;
extern uint32_t _bss_end;
extern uint32_t _data_start;
extern uint32_t _data_end;

/* g_ticks_us defined in ROMs for PRO and APP CPU */
extern uint32_t g_ticks_per_us_pro;

/* Flash data defined in ROM*/
#if CONFIG_IDF_TARGET_ESP32 || CONFIG_IDF_TARGET_ESP32S2
extern esp_rom_spiflash_chip_t g_rom_flashchip;
#else
extern esp_rom_spiflash_legacy_data_t *rom_spiflash_legacy_data;
#define g_rom_flashchip (rom_spiflash_legacy_data->chip)
#endif

static struct {
	/* offset of next flash write */
	uint32_t next_write;
	/* number of output bytes remaining to write */
	uint32_t remaining_uncompressed;
	/* number of compressed bytes remaining to read */
	uint32_t remaining_compressed;
	/* inflator state for deflate write */
	tinfl_decompressor *inflator;
	/* unzip buffer */
	uint8_t *out_buf;
	/* */
	uint8_t *next_out;
} s_fs;

static uint32_t s_encrypt_binary;

const struct esp_flash_stub_desc __attribute__((section(".stub_desc")))  s_esp_stub_desc = {
	.magic = ESP_STUB_FLASHER_MAGIC_NUM,
	.stub_version = ESP_STUB_FLASHER_VERSION,
#ifdef CMD_FLASH_IDF_BINARY
	.idf_key = ESP_STUB_FLASHER_IDF_KEY,
#else
	.idf_key = 0x00,
#endif
};

/* used in app trace module */
uint32_t esp_clk_cpu_freq(void)
{
	return g_ticks_per_us_pro * MHZ;
}

void __assert_func(const char *path, int line, const char *func, const char *msg)
{
	STUB_LOGE("ASSERT at %s:%d '%s'\n", func, line, msg);
	while (1)
		;
}

void abort(void)
{
	STUB_LOGE("ABORT\n");
	while (1)
		;
}

/* used in REGI2C_WRITE and REGI2C_WRITE_MASK */
BaseType_t xPortEnterCriticalTimeout(portMUX_TYPE *mux, BaseType_t timeout)
{
	return (BaseType_t)1;
}

#if CMD_FLASH_TEST
static int stub_flash_test(void)
{
	int ret = ESP_STUB_ERR_OK;
	uint8_t buf[32] = { 9, 1, 2, 3, 4, 5, 6, 8 };
	uint32_t flash_addr = 0x1d4000;

	esp_rom_spiflash_result_t rc = esp_rom_spiflash_erase_sector(flash_addr / STUB_FLASH_SECTOR_SIZE);
	if (rc != ESP_ROM_SPIFLASH_RESULT_OK) {
		STUB_LOGE("Failed to erase flash (%d)\n", rc);
		return ESP_STUB_ERR_FAIL;
	}

	rc = esp_rom_spiflash_write(flash_addr, (uint32_t *)buf, sizeof(buf));
	if (rc != ESP_ROM_SPIFLASH_RESULT_OK) {
		STUB_LOGE("Failed to write flash (%d)\n", rc);
		return ESP_STUB_ERR_FAIL;
	}

	rc = esp_rom_spiflash_read(flash_addr, (uint32_t *)buf, sizeof(buf));
	if (rc != ESP_ROM_SPIFLASH_RESULT_OK) {
		STUB_LOGE("Failed to read flash (%d)\n", rc);
		return ESP_STUB_ERR_FAIL;
	}

	STUB_LOGD("Data: ");
	for (int i = 0; i < 10; i++)
		STUB_LOGD("%x ", buf[i]);
	STUB_LOGD("\n");

	return ret;
}
#endif

static __maybe_unused int stub_flash_calc_hash(uint32_t addr, uint32_t size, uint8_t *hash)
{
	esp_rom_spiflash_result_t rc;
	uint32_t rd_cnt = 0, rd_sz = 0;
	uint8_t read_buf[ESP_STUB_RDWR_BUFF_SIZE];

	STUB_LOGD("%s %d bytes @ 0x%x\n", __func__, size, addr);

	stub_sha256_start();

	while (size > 0) {
		rd_sz = MIN(ESP_STUB_RDWR_BUFF_SIZE, size);
		rc = stub_flash_read_buff(addr + rd_cnt, (uint32_t *)read_buf, rd_sz);
		if (rc != ESP_ROM_SPIFLASH_RESULT_OK) {
			STUB_LOGE("Failed to read flash (%d)!\n", rc);
			return ESP_STUB_ERR_FAIL;
		}
		stub_sha256_data(read_buf, rd_sz);
		size -= rd_sz;
		rd_cnt += rd_sz;
	}

	stub_sha256_finish(hash);

	STUB_LOGD("hash: %x%x%x...%x%x%x\n",
		hash[0], hash[1], hash[2],
		hash[29], hash[30], hash[31]);

	return ESP_STUB_ERR_OK;
}

static int stub_read_data(uint32_t addr, uint8_t *buf, uint32_t size)
{
	STUB_LOGD("Read from flash addr: %x, size: %d\n", addr, size);

	return stub_flash_read_buff(addr, (uint32_t *)buf, size);
}

static __maybe_unused int stub_flash_read(uint32_t addr, uint32_t size)
{
	return stub_apptrace_send_data(addr, size, stub_read_data);
}

