espressif/openocd-esp32/contrib/loaders/flash/espressif/stub_flasher.c
static esp_rom_spiflash_result_t stub_spiflash_write(uint32_t spi_flash_addr, uint32_t *data, uint32_t len,
	bool encrypt)
{
	esp_rom_spiflash_result_t rc;

	/*
	We can ask hardware to encrypt binary as long as flash encryption is enabled and encrypt option is set.
	During breakpoint set and clear, we will set 'encrypt' flag according to efuse flash encryption settings.
	So that hardware will handle the encryption if necessary.
	During flash programming, 'encrypt' flag will reflect the user specified 'encrypt_binary' programming option.
	If this is not set, we assume the binary is encrypted by the user.
	If this is set but flash encryption is not enabled, by returning an error,
	we will warn the user to do the right operation.
	*/
	if (encrypt && stub_get_flash_encryption_mode() == ESP_FLASH_ENC_MODE_DISABLED)
		return ESP_STUB_ERR_FAIL;

	bool write_encrypted = stub_get_flash_encryption_mode() != ESP_FLASH_ENC_MODE_DISABLED && encrypt;

	STUB_BENCH(start);
	if (write_encrypted)
		rc = esp_rom_spiflash_write_encrypted(spi_flash_addr, data, len);
	else
		rc = esp_rom_spiflash_write(spi_flash_addr, data, len);
	STUB_BENCH(end);

	STUB_LOGD("Write %sflash @ 0x%x sz %d in %lld us\n",
		write_encrypted ? "encrypted-" : "",
		spi_flash_addr,
		len,
		end - start);

	return rc;
}

static __maybe_unused int stub_write_aligned_buffer(const void *data_buf, uint32_t length)
{
	while (length > 0 && s_fs.remaining_uncompressed > 0) {
		uint32_t out_bytes = length;
		uint32_t bytes_in_out_buf = s_fs.next_out - s_fs.out_buf;

		if (out_bytes + bytes_in_out_buf > ESP_STUB_UNZIP_BUFF_SIZE)
			out_bytes = ESP_STUB_UNZIP_BUFF_SIZE - bytes_in_out_buf;

		memcpy(s_fs.out_buf + bytes_in_out_buf, data_buf, out_bytes);

		bytes_in_out_buf += out_bytes;
		length -= out_bytes;
		data_buf += out_bytes;
		s_fs.next_out += out_bytes;

		if (s_fs.remaining_uncompressed - bytes_in_out_buf == 0 ||
			bytes_in_out_buf == ESP_STUB_UNZIP_BUFF_SIZE) {
			uint32_t wr_sz = bytes_in_out_buf;

			/* stub_spiflash_write() expects length to be aligned to 4 bytes.
			   If this is the last package we do not need to care about it here because OpenOCD flash driver
			   ensures that address and size are always aligned to sector size which is multiple of 4 */

			/* write buffer with aligned size */
			esp_rom_spiflash_result_t rc = stub_spiflash_write(s_fs.next_write, (uint32_t *)s_fs.out_buf,
				wr_sz, s_encrypt_binary);

			if (rc != ESP_ROM_SPIFLASH_RESULT_OK) {
				STUB_LOGE("Failed to write flash (%d)\n", rc);
				return ESP_STUB_ERR_FAIL;
			}

			/* change counters using unpadding len */
			s_fs.next_write += bytes_in_out_buf;
			s_fs.remaining_uncompressed -= bytes_in_out_buf;
			s_fs.next_out = s_fs.out_buf;
		}
	}

	return ESP_STUB_ERR_OK;
}

static int stub_write_data(const uint8_t *buf, uint32_t size)
{
	STUB_LOGD("Write data to flash size: %d\n", size);

	return stub_write_aligned_buffer(buf, size);
}

static __maybe_unused int stub_flash_write(void *args)
{
	struct esp_flash_stub_flash_write_args *wargs = (struct esp_flash_stub_flash_write_args *)args;

	s_encrypt_binary = wargs->options & ESP_STUB_FLASH_ENCRYPT_BINARY ? 1 : 0;

	uint8_t out_buf[ESP_STUB_UNZIP_BUFF_SIZE];
	s_fs.next_write = wargs->start_addr;
	s_fs.remaining_uncompressed = wargs->total_size;
	s_fs.out_buf = out_buf;
	s_fs.next_out = out_buf;

	return stub_apptrace_recv_data(args, stub_write_data);
}

static int stub_write_inflated_data(void *data_buf, uint32_t length)
{
	if (length > s_fs.remaining_uncompressed) {
		/* Trim the final block, as it may have padding beyond
		    the length we are writing */
		length = s_fs.remaining_uncompressed;
	}

	if (length == 0)
		return ESP_STUB_ERR_OK;

	/* if this is the last package */
	if (length < ESP_STUB_UNZIP_BUFF_SIZE) {
		/* stub_spiflash_write() expects length to be aligned to 4 bytes.
		   If this is the last package we do not need to care about it here because OpenOCD flash driver
		   ensures that address and size are always aligned to sector size which is multiple of 4 */
		if (s_fs.remaining_uncompressed - length != 0) {
			STUB_LOGE("Unaligned offset! %d-%d\n", length, s_fs.remaining_uncompressed);
			return ESP_STUB_ERR_FAIL;
		}
	}

	/* write buffer with aligned size */
	esp_rom_spiflash_result_t rc = stub_spiflash_write(s_fs.next_write, (uint32_t *)data_buf, length,
		s_encrypt_binary);
	if (rc != ESP_ROM_SPIFLASH_RESULT_OK) {
		STUB_LOGE("Failed to write flash (%d)\n", rc);
		return ESP_STUB_ERR_FAIL;
	}

	return ESP_STUB_ERR_OK;
}

static int stub_run_inflator(const void *data_buf, uint32_t length)
{
	int status = TINFL_STATUS_NEEDS_MORE_INPUT;

	while (length > 0 && s_fs.remaining_uncompressed > 0 && status > TINFL_STATUS_DONE) {
		/* input remaining */
		size_t in_bytes = length;
		/* output space remaining */
		size_t out_bytes = s_fs.out_buf + ESP_STUB_UNZIP_BUFF_SIZE - s_fs.next_out;
		int flags = 0;

		if (s_fs.remaining_compressed > length)
			flags |= TINFL_FLAG_HAS_MORE_INPUT;

		STUB_BENCH(start);
		status = tinfl_decompress(s_fs.inflator, data_buf, &in_bytes,
			s_fs.out_buf, s_fs.next_out, &out_bytes,
			flags);
		STUB_BENCH(end);
		STUB_LOGV("tinfl_decompress in(%d) out(%d) (%lld)us\n",
			in_bytes,
			out_bytes,
			end - start);

		s_fs.remaining_compressed -= in_bytes;
		length -= in_bytes;
		data_buf += in_bytes;
		s_fs.next_out += out_bytes;
		size_t bytes_in_out_buf = s_fs.next_out - s_fs.out_buf;

		if (status <= TINFL_STATUS_DONE ||
			bytes_in_out_buf == ESP_STUB_UNZIP_BUFF_SIZE) {
			/* Output buffer full, or done */
			if (stub_write_inflated_data(s_fs.out_buf,
					bytes_in_out_buf) != ESP_STUB_ERR_OK)
				return ESP_STUB_ERR_FAIL;

			s_fs.next_write += bytes_in_out_buf;
			s_fs.remaining_uncompressed -= bytes_in_out_buf;
			s_fs.next_out = s_fs.out_buf;
		}
	}	/* while */

	if (status < TINFL_STATUS_DONE) {
		STUB_LOGE("Failed to inflate data (%d)\n", status);
		return ESP_STUB_ERR_INFLATE;
	}
	if (status == TINFL_STATUS_DONE && s_fs.remaining_uncompressed > 0) {
		STUB_LOGE("Not enough compressed data (%d)\n", s_fs.remaining_uncompressed);
		return ESP_STUB_ERR_NOT_ENOUGH_DATA;
	}
	if (status != TINFL_STATUS_DONE && s_fs.remaining_uncompressed == 0) {
		STUB_LOGE("Too much compressed data (%d)\n", length);
		return ESP_STUB_ERR_TOO_MUCH_DATA;
	}
	return ESP_STUB_ERR_OK;
}

static __maybe_unused int stub_apptrace_process_recvd_data_deflated(const uint8_t *buf, uint32_t size)
{
	STUB_LOGD("Write zipped data size: %d\n", size);

