espressif/openocd-esp32/contrib/loaders/flash/espressif/stub_flasher.c
	return stub_run_inflator(buf, size);
}

static __maybe_unused int stub_flash_write_deflated(void *args)
{
	struct esp_flash_stub_flash_write_args *wargs = (struct esp_flash_stub_flash_write_args *)args;

	s_encrypt_binary = wargs->options & ESP_STUB_FLASH_ENCRYPT_BINARY ? 1 : 0;

	/* both of them must be in stack! */
	tinfl_decompressor inflator;
	uint8_t out_buf[ESP_STUB_UNZIP_BUFF_SIZE];

	s_fs.next_write = wargs->start_addr;
	s_fs.remaining_uncompressed = wargs->total_size;
	s_fs.remaining_compressed = wargs->size;
	s_fs.inflator = &inflator;
	s_fs.out_buf = out_buf;
	s_fs.next_out = out_buf;
	tinfl_init(s_fs.inflator);

	return stub_apptrace_recv_data(args, stub_apptrace_process_recvd_data_deflated);
}

esp_rom_spiflash_result_t esp_rom_spiflash_erase_area(uint32_t start_addr, uint32_t area_len)
{
	int32_t total_sector_num;
	int32_t head_sector_num;
	uint32_t sector_no;
	uint32_t sector_num_per_block;

	/* set read mode to Fastmode ,not QDIO mode for erase
	 *
	 * TODO: this is probably a bug as it doesn't re-enable QIO mode, not serious as this
	 * function is not used in IDF.
	 * esp_rom_spiflash_config_readmode(ESP_ROM_SPIFLASH_SLOWRD_MODE); */

	/* check if area is oversize of flash */
	if (start_addr + area_len > g_rom_flashchip.chip_size)
		return ESP_ROM_SPIFLASH_RESULT_ERR;

	/* start_addr is aligned as sector boundary */
	if (start_addr % g_rom_flashchip.sector_size != 0)
		return ESP_ROM_SPIFLASH_RESULT_ERR;

	/* Unlock flash to enable erase */
	if (esp_rom_spiflash_unlock(/*&g_rom_flashchip*/) != ESP_ROM_SPIFLASH_RESULT_OK)
		return ESP_ROM_SPIFLASH_RESULT_ERR;

	sector_no = start_addr / g_rom_flashchip.sector_size;
	sector_num_per_block = g_rom_flashchip.block_size / g_rom_flashchip.sector_size;
	total_sector_num = area_len % g_rom_flashchip.sector_size == 0 ?
		area_len / g_rom_flashchip.sector_size :
		1 + (area_len / g_rom_flashchip.sector_size);
	/* check if erase area reach over block boundary */
	head_sector_num = sector_num_per_block - (sector_no % sector_num_per_block);
	head_sector_num = head_sector_num >= total_sector_num ? total_sector_num : head_sector_num;

	/* JJJ, BUG of 6.0 erase
	 * middle part of area is aligned by blocks */
	total_sector_num -= head_sector_num;

	STUB_LOGD("tsn:%d hsn:%d sn:%d snpb:%d\n", total_sector_num, head_sector_num, sector_no, sector_num_per_block);

	/* head part of area is erased */
	while (head_sector_num > 0) {
		if (esp_rom_spiflash_erase_sector(sector_no) != ESP_ROM_SPIFLASH_RESULT_OK)
			return ESP_ROM_SPIFLASH_RESULT_ERR;
		sector_no++;
		head_sector_num--;
	}
	while (total_sector_num > sector_num_per_block) {
		if (ESP_ROM_SPIFLASH_RESULT_OK !=
			esp_rom_spiflash_erase_block(sector_no / sector_num_per_block))
			return ESP_ROM_SPIFLASH_RESULT_ERR;
		sector_no += sector_num_per_block;
		total_sector_num -= sector_num_per_block;
	}

	/* tail part of area burn */
	while (total_sector_num > 0) {
		if (esp_rom_spiflash_erase_sector(sector_no) != ESP_ROM_SPIFLASH_RESULT_OK)
			return ESP_ROM_SPIFLASH_RESULT_ERR;
		sector_no++;
		total_sector_num--;
	}

	return ESP_ROM_SPIFLASH_RESULT_OK;
}

static __maybe_unused int stub_flash_erase(uint32_t flash_addr, uint32_t size)
{
	int ret = ESP_STUB_ERR_OK;

	if (flash_addr & (STUB_FLASH_SECTOR_SIZE - 1))
		flash_addr &= ~(STUB_FLASH_SECTOR_SIZE - 1);

	if (size & (STUB_FLASH_SECTOR_SIZE - 1))
		size = (size + (STUB_FLASH_SECTOR_SIZE - 1)) & ~(STUB_FLASH_SECTOR_SIZE - 1);

	STUB_LOGD("erase flash @ 0x%x, sz %d\n", flash_addr, size);

	STUB_BENCH(start);
	esp_rom_spiflash_result_t rc = esp_rom_spiflash_erase_area(flash_addr, size);
	if (rc != ESP_ROM_SPIFLASH_RESULT_OK) {
		STUB_LOGE("Failed to erase flash (%d)\n", rc);
		return ESP_STUB_ERR_FAIL;
	}
	STUB_BENCH(end);
	STUB_LOGD("Erased %d bytes @ 0x%x in %lld ms\n", size, flash_addr,
		(end - start) / 1000);
	return ret;
}

static __maybe_unused int stub_flash_erase_check(uint32_t start_sec, uint32_t sec_num, uint8_t *sec_erased)
{
	int ret = ESP_STUB_ERR_OK;
	uint8_t buf[STUB_FLASH_SECTOR_SIZE / 8];/* implying that sector size is multiple of sizeof(buf) */

	STUB_LOGD("erase check start %d, sz %d\n", start_sec, sec_num);

	for (int i = start_sec; i < start_sec + sec_num; i++) {
		sec_erased[i] = 1;
		for (int k = 0; k < STUB_FLASH_SECTOR_SIZE / sizeof(buf); k++) {
			esp_rom_spiflash_result_t rc = stub_flash_read_buff(i * STUB_FLASH_SECTOR_SIZE + k * sizeof(buf),
				(uint32_t *)buf,
				sizeof(buf));
			if (rc != ESP_ROM_SPIFLASH_RESULT_OK) {
				STUB_LOGE("Failed to read flash (%d)!\n", rc);
				return ESP_STUB_ERR_FAIL;
			}
			for (int n = 0; n < sizeof(buf); n++) {
				if (buf[n] != 0xFF) {
					sec_erased[i] = 0;
					break;
				}
			}
			if (!sec_erased[i])
				break;
		}
	}

	STUB_LOGD("erase checked\n");

	return ret;
}

static uint32_t stub_flash_get_size(void)
{
	uint32_t size = 0;

	STUB_LOGD("%s: ENTER\n", __func__);

	uint32_t id = stub_flash_get_id();
	switch (id) {
		case 0x12:
			size = 256 * 1024;
			break;
		case 0x13:
			size = 512 * 1024;
			break;
		case 0x14:
			size = 1 * 1024 * 1024;
			break;
		case 0x15:
			size = 2 * 1024 * 1024;
			break;
		case 0x16:
			size = 4 * 1024 * 1024;
			break;
		case 0x17:
			size = 8 * 1024 * 1024;
			break;
		case 0x18:
			size = 16 * 1024 * 1024;
			break;
		case 0x19:
			size = 32 * 1024 * 1024;
			break;
		case 0x20:
			size = 64 * 1024 * 1024;
			break;
		case 0x21:
			size = 128 * 1024 * 1024;
			break;
		case 0x22:
			size = 256 * 1024 * 1024;
			break;
		case 0x39:
			size = 32 * 1024 * 1024;
			break;
	default:
		size = 0;
	}
	STUB_LOGD("Flash ID %x, size %d KB\n", id, size / 1024);
	return size;
}

union stub_image_header {
	struct {
		uint8_t esp_magic;
		uint8_t segment_count;
	};
	uint32_t mcuboot_magic;
};

/* Mcu Boot Image Layout
 * mcuboot_hdr: org = 0x0,  len = 0x20 (magic 0x96f3b83d)
 * metadata:    org = 0x20, len = 0x60 (magic 0xace637d3)
 * FLASH:       org = 0x80, len = FLASH_SIZE - 0x80
*/
static int stub_flash_get_mcuboot_mappings(uint32_t off, struct esp_flash_mapping *flash_map)
{
	esp_program_header_t prg_hdr;
	esp_rom_spiflash_result_t rc = stub_flash_read_buff(off + MCU_BOOT_HEADER_SIZE,
		(uint32_t *)&prg_hdr, sizeof(prg_hdr));
	if (rc != ESP_ROM_SPIFLASH_RESULT_OK) {
		STUB_LOGE("Failed to read mcuboot header\n");
		return ESP_STUB_ERR_READ_APP_IMAGE_HEADER;
	}

	if (prg_hdr.header_magic != MCU_BOOT_PROGRAM_HEADER_MAGIC) {
		STUB_LOGE("Invalid magic number 0x%x\n", prg_hdr.header_magic);
		return ESP_STUB_ERR_INVALID_APP_MAGIC;
	}

	if (!IS_DROM(prg_hdr.drom_map_addr) || !IS_IROM(prg_hdr.irom_map_addr)) {
		STUB_LOGE("Invalid DROM/IROM addr (0x%x)/(0x%x)\n",
			prg_hdr.drom_map_addr, prg_hdr.irom_map_addr);
		return ESP_STUB_ERR_FAIL;
	}

