espressif/openocd-esp32/contrib/loaders/flash/espressif/stub_flasher.c
	flash_map->maps[0].phy_addr = prg_hdr.drom_flash_offset + off;
	flash_map->maps[0].load_addr = prg_hdr.drom_map_addr;
	flash_map->maps[0].size = prg_hdr.drom_size;
	flash_map->maps[1].phy_addr = prg_hdr.irom_flash_offset + off;
	flash_map->maps[1].load_addr = prg_hdr.irom_map_addr;
	flash_map->maps[1].size = prg_hdr.irom_size;
	flash_map->maps_num = 2;

	for (unsigned int map_num = 0; map_num < 2; ++map_num)
		STUB_LOGI("Mapped segment %d: %d bytes @ 0x%x -> 0x%x\n",
			map_num,
			flash_map->maps[map_num].size,
			flash_map->maps[map_num].phy_addr,
			flash_map->maps[map_num].load_addr);

	return ESP_STUB_ERR_OK;
}

static int stub_flash_get_app_mappings(uint32_t off, struct esp_flash_mapping *flash_map)
{
	union stub_image_header stub_img_hdr;
	uint16_t maps_num = 0;
	bool padding_checksum = false;
	unsigned int ram_segments = 0;

	/* clear the flash mappings */
	for (int i = 0; i < ESP_STUB_FLASH_MAPPINGS_MAX_NUM; i++)
		flash_map->maps[i].load_addr = 0;

	esp_rom_spiflash_result_t rc = stub_flash_read_buff(off, &stub_img_hdr, sizeof(stub_img_hdr));
	if (rc != ESP_ROM_SPIFLASH_RESULT_OK) {
		STUB_LOGE("Failed to read magic byte!\n");
		return ESP_STUB_ERR_READ_APP_IMAGE_HEADER;
	}

	if (stub_img_hdr.mcuboot_magic == MCU_BOOT_HEADER_MAGIC) {
		STUB_LOGI("Mcu boot header found\n");
		return stub_flash_get_mcuboot_mappings(off, flash_map);
	}

	if (stub_img_hdr.esp_magic != ESP_IMAGE_HEADER_MAGIC) {
		STUB_LOGE("Invalid magic number 0x%x\n", stub_img_hdr.esp_magic);
		return ESP_STUB_ERR_INVALID_APP_MAGIC;
	}

	STUB_LOGI("Found app image: magic 0x%x, %d segments\n",
		stub_img_hdr.esp_magic,
		stub_img_hdr.segment_count);

	uint32_t flash_addr = off + sizeof(esp_image_header_t);

	for (int k = 0; k < MAX_SEGMENT_COUNT; k++) {
		esp_image_segment_header_t seg_hdr;
		rc = stub_flash_read_buff(flash_addr, (uint32_t *)&seg_hdr, sizeof(seg_hdr));
		if (rc != ESP_ROM_SPIFLASH_RESULT_OK) {
			STUB_LOGE("Failed to read app segment header (%d)!\n", rc);
			return ESP_STUB_ERR_READ_APP_SEGMENT;
		}
		STUB_LOGI("App segment %d: %d bytes @ 0x%x\n",
			k,
			seg_hdr.data_len,
			seg_hdr.load_addr);

		if (IS_NONE(seg_hdr.load_addr))
			break;

		if (IS_RTC_FAST_IRAM(seg_hdr.load_addr) || IS_RTC_FAST_DRAM(seg_hdr.load_addr) ||
			IS_RTC_SLOW_DRAM(seg_hdr.load_addr) || IS_TCM(seg_hdr.load_addr))
			ram_segments++;

		if (IS_MMAP(seg_hdr.load_addr)) {
			STUB_LOGI("Mapped segment %d: %d bytes @ 0x%x -> 0x%x\n",
				maps_num,
				seg_hdr.data_len,
				flash_addr + sizeof(seg_hdr),
				seg_hdr.load_addr);

			/*
			 * Make sure DROM mapping will be at the first index. (OpenOCD expects DROM mapping at index 0)
			 * Note: New targets have identical IROM/DROM address. Thats why additional check is needed.
			 */
			int index = IS_DROM(seg_hdr.load_addr) && !flash_map->maps[0].load_addr ? 0 : 1;
			flash_map->maps[index].phy_addr = flash_addr + sizeof(seg_hdr);
			flash_map->maps[index].load_addr = seg_hdr.load_addr;
			flash_map->maps[index].size = seg_hdr.data_len;
			maps_num++;

			if (maps_num >= ESP_STUB_FLASH_MAPPINGS_MAX_NUM)
				/* No need to read more. DROM, IROM mapping is done */
				break;
		}

		if (IS_SRAM(seg_hdr.load_addr))
			ram_segments++;

		flash_addr += sizeof(seg_hdr) + seg_hdr.data_len;
		if (ram_segments == stub_img_hdr.segment_count && !padding_checksum) {
			/* add padding */
			flash_addr += CHECKSUM_ALIGN - (flash_addr % CHECKSUM_ALIGN);
			padding_checksum = true;
		}
	}
	flash_map->maps_num = maps_num;
	return ESP_STUB_ERR_OK;
}

static __maybe_unused int stub_flash_get_map(uint32_t app_off, uint32_t maps_addr, uint32_t flash_size)
{
	esp_rom_spiflash_result_t rc;
	esp_partition_info_t part;
	struct esp_stub_flash_map *flash_map = (struct esp_stub_flash_map *)maps_addr;

	flash_map->flash_size = flash_size;
	if (flash_size == 0) {
		flash_map->retcode = ESP_STUB_ERR_FLASH_SIZE;
		return ESP_STUB_ERR_OK;
	}

	STUB_LOGD("%s: 0x%x 0x%x\n", __func__, app_off, maps_addr);
	flash_map->retcode = ESP_STUB_ERR_OK;
	flash_map->map.maps_num = 0;
	if (app_off != (uint32_t)-1) {
		flash_map->retcode = stub_flash_get_app_mappings(app_off, &flash_map->map);
		return ESP_STUB_ERR_OK;
	}

	for (uint32_t i = 0;; i++) {
		rc = stub_flash_read_buff(ESP_PARTITION_TABLE_OFFSET + i * sizeof(esp_partition_info_t),
				(uint32_t *)&part,
				sizeof(part));
		if (rc != ESP_ROM_SPIFLASH_RESULT_OK) {
			STUB_LOGE("Failed to read partitions table entry (%d)!\n", rc);
			flash_map->retcode = ESP_STUB_ERR_READ_PARTITION;
			return ESP_STUB_ERR_OK;
		}
		if (part.magic != ESP_PARTITION_MAGIC) {
			STUB_LOGE("Invalid partition table magic! (0x%x)\n", part.magic);
			flash_map->retcode = ESP_STUB_ERR_INVALID_IMAGE;
			return ESP_STUB_ERR_OK;
		}
		if (part.pos.offset > flash_size || part.pos.offset + part.pos.size > flash_size) {
			STUB_LOGE("Partition %d invalid - offset 0x%x size 0x%x exceeds flash chip size 0x%x\n",
				i,
				part.pos.offset,
				part.pos.size,
				flash_size);
			flash_map->retcode = ESP_STUB_ERR_INVALID_PARTITION;
			return ESP_STUB_ERR_OK;
		}
		STUB_LOGD("Found partition %d, m 0x%x, t 0x%x, st 0x%x, l '%s'\n",
			i,
			part.magic,
			part.type,
			part.subtype,
			part.label);
		if (part.type == PART_TYPE_APP) {
			STUB_LOGI("Found app partition: '%s' %d KB @ 0x%x\n",
				part.label,
				part.pos.size / 1024,
				part.pos.offset);
			flash_map->retcode = stub_flash_get_app_mappings(part.pos.offset, &flash_map->map);
			return ESP_STUB_ERR_OK;
		}
	}
	/* PART_TYPE_APP not found */
	return ESP_STUB_ERR_OK;
}

#define ALIGN_DOWN(x, a)        ((x) & ~((typeof(x))(a) - 1))

static size_t stub_get_inst_buff_size(uint32_t bp_flash_addr, uint8_t inst_size)
{
	int sector_no = ALIGN_DOWN(bp_flash_addr, STUB_FLASH_SECTOR_SIZE) / STUB_FLASH_SECTOR_SIZE;
	int next_sector_no = ALIGN_DOWN(bp_flash_addr + inst_size, STUB_FLASH_SECTOR_SIZE) / STUB_FLASH_SECTOR_SIZE;
	size_t buff_size = STUB_FLASH_SECTOR_SIZE;
	if (next_sector_no > sector_no)
		buff_size *= 2;
	STUB_LOGD("%s: %d %d 0x%x\n", __func__, sector_no, next_sector_no, buff_size);
	return buff_size;
}

/**
* Possible BP layouts in flash:
* 1) addr is aligned to 4 bytes (in 1 sector)
* 2) addr is unaligned to 4 bytes, BP is not crossing sector's boundary (in 1 sector)
*   - not crossing 4 bytes alignment boundary
*   - crossing 4 bytes alignment boundary
* 3) addr is unaligned to 4 bytes, BP is crossing sector's boundary (in 2 sectors)
*/
static __maybe_unused uint8_t stub_flash_set_bp(uint32_t bp_flash_addr,
	uint32_t insn_buf_addr, uint8_t *insn_sect)
{
	esp_rom_spiflash_result_t rc;
	const size_t inst_buff_size = stub_get_inst_buff_size(bp_flash_addr, stub_get_max_insn_size());

	STUB_LOGD("%s: 0x%x 0x%x\n", __func__, bp_flash_addr, insn_buf_addr);

