espressif/openocd-esp32/contrib/loaders/flash/espressif/stub_flasher.c
	stub_flash_cache_flush();

	rc = stub_flash_read_buff(ALIGN_DOWN(bp_flash_addr, STUB_FLASH_SECTOR_SIZE),
		(uint32_t *)insn_sect,
		inst_buff_size);
	if (rc != ESP_ROM_SPIFLASH_RESULT_OK) {
		STUB_LOGE("Failed to read insn sector (%d)!\n", rc);
		return 0;
	}
	uint8_t insn_sz = stub_get_insn_size(&insn_sect[bp_flash_addr & (STUB_FLASH_SECTOR_SIZE - 1)]);
	memcpy((void *)insn_buf_addr, &insn_sect[(bp_flash_addr & (STUB_FLASH_SECTOR_SIZE - 1))], insn_sz);
	STUB_LOGI("Read insn [%02x %02x %02x %02x] %d bytes @ 0x%x\n",
		insn_sect[(bp_flash_addr & (STUB_FLASH_SECTOR_SIZE - 1)) + 0],
		insn_sect[(bp_flash_addr & (STUB_FLASH_SECTOR_SIZE - 1)) + 1],
		insn_sect[(bp_flash_addr & (STUB_FLASH_SECTOR_SIZE - 1)) + 2],
		insn_sect[(bp_flash_addr & (STUB_FLASH_SECTOR_SIZE - 1)) + 3],
		insn_sz,
		bp_flash_addr);

	/* this will erase full sector or two */
	if (stub_flash_erase(bp_flash_addr, inst_buff_size) != ESP_STUB_ERR_OK) {
		STUB_LOGE("Failed to erase insn sector!\n");
		return 0;
	}
	union {
		uint32_t d32;
		uint8_t d8[4];
	} break_insn;
	break_insn.d32 = stub_get_break_insn(insn_sz);
	insn_sect[(bp_flash_addr & (STUB_FLASH_SECTOR_SIZE - 1)) + 0] = break_insn.d8[0];
	insn_sect[(bp_flash_addr & (STUB_FLASH_SECTOR_SIZE - 1)) + 1] = break_insn.d8[1];
	if (insn_sz > 2)
		insn_sect[(bp_flash_addr & (STUB_FLASH_SECTOR_SIZE - 1)) + 2] = break_insn.d8[2];
	if (insn_sz > 3)
		insn_sect[(bp_flash_addr & (STUB_FLASH_SECTOR_SIZE - 1)) + 3] = break_insn.d8[3];
	rc = stub_spiflash_write(bp_flash_addr & ~(STUB_FLASH_SECTOR_SIZE - 1),
		(uint32_t *)insn_sect,
		inst_buff_size,
		stub_get_flash_encryption_mode() != ESP_FLASH_ENC_MODE_DISABLED);
	if (rc != ESP_ROM_SPIFLASH_RESULT_OK) {
		STUB_LOGE("Failed to write break insn (%d)!\n", rc);
		return 0;
	}

	stub_flash_cache_flush();

#if STUB_LOG_ENABLE == 1
	if (stub_get_log_level() >= STUB_LOG_LEVEL_DEBUG) {
		uint8_t tmp[8];
		rc = stub_flash_read_buff(bp_flash_addr & ~0x3UL, (uint32_t *)tmp, sizeof(tmp));
		if (rc != ESP_ROM_SPIFLASH_RESULT_OK) {
			STUB_LOGE("Failed to read insn (%d)!\n", rc);
			return ESP_STUB_ERR_FAIL;
		}
		STUB_LOGD("%s: WROTE 0x%x 0x%x [%02x %02x %02x %02x %02x %02x %02x %02x]\n",
			__func__,
			bp_flash_addr,
			insn_buf_addr,
			tmp[0],
			tmp[1],
			tmp[2],
			tmp[3],
			tmp[4],
			tmp[5],
			tmp[6],
			tmp[7]);
	}
#endif
	return insn_sz;
}

/*
 * This function combines multiple flash addresses and instructions into a single buffer.
 * The following variables are used:
 * bp_flash_addr --> bp0_flash_addr + bp1_flash_addr + bp2_flash_addr + ... + bpn_flash_addr
 * insn_buf_addr <-- insn_sz0 + inst0 + insn_sz1 + inst1 + insn_sz2 + inst2 + ... + insn_szn + instn
 *
 * Each bp_flash_addr is 4 bytes long.
 * Each insn_sz is 1 byte long, representing the size of the corresponding instruction. (2 or 3)
 * Each inst is 3 bytes long.
 *
 */
static __maybe_unused uint8_t stub_flash_set_bp_multi(uint32_t *bp_flash_addr,
	uint8_t *insn_buf_addr, uint8_t *insn_sect, uint32_t num_bps)
{
	STUB_LOGD("%s %d bps\n", __func__, num_bps);

	struct esp_flash_stub_bp_instructions *bp_insts = (struct esp_flash_stub_bp_instructions *)insn_buf_addr;
	for (size_t i = 0; i < num_bps; ++i) {
		uint8_t rc = stub_flash_set_bp(bp_flash_addr[i], (uint32_t)&bp_insts[i].buff, insn_sect);
		if (rc == 0)
			return rc;
		bp_insts[i].size = rc;
	}

	return num_bps * sizeof(struct esp_flash_stub_bp_instructions);
}

static __maybe_unused int stub_flash_clear_bp(uint32_t bp_flash_addr,
	uint32_t insn_buf_addr, uint8_t *insn_sect)
{
	esp_rom_spiflash_result_t rc;
	uint8_t *insn = (uint8_t *)insn_buf_addr;
	uint8_t insn_sz = stub_get_insn_size(insn);
	const size_t inst_buff_size = stub_get_inst_buff_size(bp_flash_addr, insn_sz);

	STUB_LOGD("%s: 0x%x 0x%x [%02x %02x %02x %02x]\n",
		__func__,
		bp_flash_addr,
		insn_buf_addr,
		insn[0],
		insn[1],
		insn[2],
		insn[3]);

	stub_flash_cache_flush();

	rc = stub_flash_read_buff(ALIGN_DOWN(bp_flash_addr, STUB_FLASH_SECTOR_SIZE),
		(uint32_t *)insn_sect,
		inst_buff_size);
	if (rc != ESP_ROM_SPIFLASH_RESULT_OK) {
		STUB_LOGE("Failed to read insn sector (%d)!\n", rc);
		return ESP_STUB_ERR_FAIL;
	}

	/* this will erase full sector or two */
	if (stub_flash_erase(bp_flash_addr, inst_buff_size) != ESP_STUB_ERR_OK) {
		STUB_LOGE("Failed to erase insn sector!\n");
		return ESP_STUB_ERR_FAIL;
	}
	insn_sect[(bp_flash_addr & (STUB_FLASH_SECTOR_SIZE - 1)) + 0] = insn[0];
	insn_sect[(bp_flash_addr & (STUB_FLASH_SECTOR_SIZE - 1)) + 1] = insn[1];
	if (insn_sz > 2)
		insn_sect[(bp_flash_addr & (STUB_FLASH_SECTOR_SIZE - 1)) + 2] = insn[2];
	if (insn_sz > 3)
		insn_sect[(bp_flash_addr & (STUB_FLASH_SECTOR_SIZE - 1)) + 3] = insn[3];
	rc = stub_spiflash_write(bp_flash_addr & ~(STUB_FLASH_SECTOR_SIZE - 1),
		(uint32_t *)insn_sect,
		inst_buff_size,
		stub_get_flash_encryption_mode() != ESP_FLASH_ENC_MODE_DISABLED);
	if (rc != ESP_ROM_SPIFLASH_RESULT_OK) {
		STUB_LOGE("Failed to restore insn (%d)!\n", rc);
		return ESP_STUB_ERR_FAIL;
	}

	stub_flash_cache_flush();

#if STUB_LOG_ENABLE == 1
	if (stub_get_log_level() >= STUB_LOG_LEVEL_DEBUG) {
		uint8_t tmp[8];
		rc = stub_flash_read_buff(bp_flash_addr & ~0x3UL, (uint32_t *)tmp, sizeof(tmp));
		if (rc != ESP_ROM_SPIFLASH_RESULT_OK) {
			STUB_LOGE("Failed to read insn (%d)!\n", rc);
			return ESP_STUB_ERR_FAIL;
		}
		STUB_LOGD("%s: WROTE 0x%x 0x%x [%02x %02x %02x %02x %02x %02x %02x %02x]\n",
			__func__,
			bp_flash_addr,
			insn_buf_addr,
			tmp[0],
			tmp[1],
			tmp[2],
			tmp[3],
			tmp[4],
			tmp[5],
			tmp[6],
			tmp[7]);
	}
#endif
	return ESP_STUB_ERR_OK;
}

static __maybe_unused uint8_t stub_flash_clear_bp_multi(uint32_t *bp_flash_addr,
	uint8_t *insn_buf_addr, uint8_t *insn_sect, uint32_t num_bps)
{
	STUB_LOGD("%s %d bps\n", __func__, num_bps);

	struct esp_flash_stub_bp_instructions *bp_insts = (struct esp_flash_stub_bp_instructions *)insn_buf_addr;

	for (size_t i = 0; i < num_bps; ++i) {
		int rc = stub_flash_clear_bp(bp_flash_addr[i], (uint32_t)&bp_insts[i].buff, insn_sect);
		if (rc < 0)
			return rc;
	}

	return ESP_STUB_ERR_OK;
}

static int stub_flash_handler(int cmd, va_list ap)
{
	int ret = ESP_STUB_ERR_OK;
	struct stub_flash_state flash_state;
	uint32_t arg1 __maybe_unused = va_arg(ap, uint32_t);  /* flash_addr, start_sect */
	uint32_t arg2 __maybe_unused = va_arg(ap, uint32_t);	/* number of sectors */
	uint8_t *arg3 __maybe_unused = va_arg(ap, uint8_t *);	/* sectors' state buf address */
	uint32_t arg4 __maybe_unused = va_arg(ap, uint32_t);	/* set/clear bp count */

	STUB_LOGD("%s arg1 %x, arg2 %d\n", __func__, arg1, arg2);

