espressif/openocd-esp32/contrib/loaders/flash/espressif/stub_flasher.c
	stub_flash_state_prepare(&flash_state);

	uint32_t flash_size = stub_flash_get_size();
	if (flash_size == 0) {
		STUB_LOGE("Failed to get flash size!\n");
		if (cmd != ESP_STUB_CMD_FLASH_MAP_GET) {
			ret = ESP_STUB_ERR_FAIL;
			goto _flash_end;
		}
		/* We will fill the esp_stub_flash_map struct and set the return code there */
	} else {
		esp_rom_spiflash_config_param(g_rom_flashchip.device_id,
			flash_size,
			STUB_FLASH_BLOCK_SIZE,
			STUB_FLASH_SECTOR_SIZE,
			STUB_FLASH_PAGE_SIZE,
			STUB_FLASH_STATUS_MASK);

		esp_rom_spiflash_result_t rc = esp_rom_spiflash_unlock();
		if (rc != ESP_ROM_SPIFLASH_RESULT_OK) {
			STUB_LOGE("Failed to unlock flash (%d)\n", rc);
			ret = ESP_STUB_ERR_FAIL;
			goto _flash_end;
		}
	}

	switch (cmd) {
#ifdef CMD_FLASH_READ
	case ESP_STUB_CMD_FLASH_READ:
		ret = stub_flash_read(arg1, arg2);
		break;
#endif
#ifdef CMD_FLASH_ERASE
	case ESP_STUB_CMD_FLASH_ERASE:
		ret = stub_flash_erase(arg1, arg2);
		break;
#endif
#ifdef CMD_FLASH_ERASE_CHECK
	case ESP_STUB_CMD_FLASH_ERASE_CHECK:
		ret = stub_flash_erase_check(arg1, arg2, arg3);
		break;
#endif
#ifdef CMD_FLASH_WRITE
	case ESP_STUB_CMD_FLASH_WRITE:
		ret = stub_flash_write((void *)arg1);
		break;
#endif
#ifdef CMD_FLASH_WRITE_DEFLATED
	case ESP_STUB_CMD_FLASH_WRITE_DEFLATED:
		ret = stub_flash_write_deflated((void *)arg1);
		break;
#endif
#ifdef CMD_FLASH_CALC_HASH
	case ESP_STUB_CMD_FLASH_CALC_HASH:
		ret = stub_flash_calc_hash(arg1, arg2, arg3);
		break;
#endif
#if defined(CMD_FLASH_MAP_GET) || defined(CMD_FLASH_MULTI_COMMAND) || defined(CMD_FLASH_IDF_BINARY)
	case ESP_STUB_CMD_FLASH_MAP_GET:
		ret = stub_flash_get_map(arg1, arg2, flash_size);
		break;
#endif
#if defined(CMD_FLASH_BP_SET) || defined(CMD_FLASH_MULTI_COMMAND) || defined(CMD_FLASH_IDF_BINARY)
	case ESP_STUB_CMD_FLASH_BP_SET:
		ret = stub_flash_set_bp_multi((void *)arg1, (void *)arg2, (void *)arg3, arg4);
		break;
#endif
#if defined(CMD_FLASH_BP_CLEAR) || defined(CMD_FLASH_MULTI_COMMAND) || defined(CMD_FLASH_IDF_BINARY)
	case ESP_STUB_CMD_FLASH_BP_CLEAR:
		ret = stub_flash_clear_bp_multi((void *)arg1, (void *)arg2, (void *)arg3, arg4);
		break;
#endif
#ifdef CMD_FLASH_CLOCK_CONFIGURE
	case ESP_STUB_CMD_FLASH_CLOCK_CONFIGURE:
		ret = stub_cpu_clock_configure(arg1);
		if (stub_get_log_dest() == STUB_LOG_DEST_UART)
			stub_uart_console_configure(stub_get_log_dest());
		break;
#endif
#ifdef CMD_FLASH_TEST
	case ESP_STUB_CMD_FLASH_TEST:
		ret = stub_flash_test();
		break;
#endif
	default:
		ret = ESP_STUB_ERR_NOT_SUPPORTED;
	}

_flash_end:
	stub_flash_state_restore(&flash_state);
	return ret;
}

uint32_t stub_esp_clk_cpu_freq(void)
{
	extern uint32_t g_stub_cpu_freq_hz;
	return g_stub_cpu_freq_hz;
}

void ets_update_cpu_frequency(uint32_t ticks_per_us)
{
	/* do nothing for stub */
}

__attribute__((weak)) int stub_cpu_clock_configure(int cpu_freq_mhz)
{
	return 0;
}

__attribute__((weak)) void stub_uart_console_configure(int dest)
{
}

__attribute__((weak)) esp_flash_enc_mode_t stub_get_flash_encryption_mode(void)
{
	return ESP_FLASH_ENC_MODE_DISABLED;
}

__attribute__((weak)) void stub_log_init(enum stub_log_levels level, enum stub_log_destination dest)
{
}

#if STUB_LOG_ENABLE == 1
const char *cmd_to_str(int cmd)
{
	switch (cmd) {
	case ESP_STUB_CMD_FLASH_READ: return "FLASH_READ";
	case ESP_STUB_CMD_FLASH_WRITE: return "FLASH_WRITE";
	case ESP_STUB_CMD_FLASH_ERASE: return "FLASH_ERASE";
	case ESP_STUB_CMD_FLASH_ERASE_CHECK: return "FLASH_ERASE_CHECK";
	case ESP_STUB_CMD_FLASH_MAP_GET: return "FLASH_MAP_GET";
	case ESP_STUB_CMD_FLASH_BP_SET: return "FLASH_BP_SET";
	case ESP_STUB_CMD_FLASH_BP_CLEAR: return "FLASH_BP_CLEAR";
	case ESP_STUB_CMD_FLASH_TEST: return "FLASH_TEST";
	case ESP_STUB_CMD_FLASH_WRITE_DEFLATED: return "FLASH_WRITE_DEFLATED";
	case ESP_STUB_CMD_FLASH_CALC_HASH: return "FLASH_CALC_HASH";
	case ESP_STUB_CMD_FLASH_CLOCK_CONFIGURE: return "CLOCK_CONFIGURE";
	default: return "";
	}
}
#endif

int stub_main(int cmd, ...)
{
	va_list ap;
	int ret = 0;

	/* zero bss */
	for (uint32_t *p = &_bss_start; p < &_bss_end; p++)
		*p = 0;

	/* we get here just after OpenOCD's stub trampoline
	 * up to 5 parameters are passed via registers by that jumping code */
	/* interrupts level in PS is set to 5 to allow high prio IRQs only (including Debug Interrupt) */
	/* We need Debug Interrupt Level to allow breakpoints handling by OpenOCD */
	stub_log_init(STUB_RESET_LOG_LEVEL, STUB_RESET_LOG_DEST);
	STUB_LOGD("cpu_freq:%d Mhz\n", stub_esp_clk_cpu_freq() / MHZ);
	STUB_LOGD("DATA 0x%x..0x%x\n", &_data_start, &_data_end);
	STUB_LOGD("BSS 0x%x..0x%x\n", &_bss_start, &_bss_end);
	STUB_LOGD("cmd %d:%s\n", cmd, cmd_to_str(cmd));

	va_start(ap, cmd);
	if (cmd <= ESP_STUB_CMD_FLASH_MAX_ID) {
		ret = stub_flash_handler(cmd, ap);
	} else {
		switch (cmd) {
#if STUB_DEBUG
		case ESP_STUB_CMD_TEST:
			STUB_LOGD("TEST %d\n", cmd);
			break;
#endif
		default:
			ret = ESP_STUB_ERR_NOT_SUPPORTED;
		}
	}
	va_end(ap);

	STUB_LOGD("exit %d\n", ret);
	return ret;
}
